src/DataProcessors/ПомощникВводаПервичныхДанныхПроекта/ПомощникВводаПервичныхДанныхПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникВводаПервичныхДанныхПроекта</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Documents/СогласованиеПроектов/СогласованиеПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласованиеПроектов</name>
  <registerRecords>InformationRegister.УП_ОбщиеСведенияПоПроектам</registerRecords>
  <registerRecords>InformationRegister.УП_ВремяВыполнениеПроектов_План</registerRecords>
  <registerRecords>InformationRegister.ВремяВыполненияПроектов</registerRecords>
  <registerRecords>InformationRegister.ОбщиеДанныеПоПроектам</registerRecords>
  <registerRecords>InformationRegister.СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_ИсполнителиПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СтоимостьПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектовИсполнителей</registerRecords>
  <registerRecords>InformationRegister.СтоимостьПроектов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПроекта</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнитьДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВыполнениеРаботНадПроектом/ВыполнениеРаботНадПроектом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеРаботНадПроектом</name>
  <registerRecords>InformationRegister.ВремяВыполненияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_ВремяВыполнениеПроектов_Факт</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВыполнениеПроектов/ВыполнениеПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеПроектов</name>
  <registerRecords>InformationRegister.УП_ОбщиеСведенияПоПроектам</registerRecords>
  <registerRecords>AccumulationRegister.УП_РасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.УП_РасчетыСИсполнителями</registerRecords>
  <registerRecords>InformationRegister.СостоянияПроектов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_ИсполнителиПроектов_Факт</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектовИсполнителей</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученАктОтЗаказчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияАктаОтЗаказчика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗачестьПредоплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриПечатиКоличествоРавно1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеОплатыОтКонтрагента/ПоступлениеОплатыОтКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеОплатыОтКонтрагента</name>
  <registerRecords>AccumulationRegister.УП_РасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>CatalogRef.СпособыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчаствуетВРассылкеПоЭлектроннойПочте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПомощникВводаПервичныхДанныхПроекта/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОбработки = ТекущаяДата();
	ВыполнитьДо = ДатаОбработки + 3600 * 24 * 3;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	Отказ = ВыполнитьПроверкуЗаполненияРеквизитов();
	Если НЕ Отказ Тогда
		Если СоздатьДокументСогласования Тогда
			СоздатьДокументСогласованияНаСервере();
		КонецЕсли;
		Если СоздатьДокументВыполненияРаботНадПроектом Тогда
			СоздатьДокументВыполненияРаботНадПроектомНаСервере();
		КонецЕсли;
		Если СоздатьДокументВыполненияПроектов Тогда
			СоздатьДокументВыполненияПроектовНаСервере();
		КонецЕсли;
		Если СоздатьДокументПоступлениеОплаты Тогда
			СоздатьДокументПоступлениеОплатыНаСервере();
		КонецЕсли;
		Предупреждение("Создание документов завершено. Форма будет закрыта...");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументСогласованияПриИзменении(Элемент)
	
	Элементы.РуководительПроекта.Доступность     = СоздатьДокументСогласования;
	Элементы.ВыполнитьДо.Доступность             = СоздатьДокументСогласования;
	Элементы.ВремяВыполнения_План.Доступность    = СоздатьДокументСогласования;
	Элементы.Сумма.Доступность                   = СоздатьДокументСогласования;
	Элементы.КомментарийСогласования.Доступность = СоздатьДокументСогласования;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументВыполненияРаботНадПроектомПриИзменении(Элемент)
	
	Элементы.ВремяВыполнения_Факт.Доступность                  = СоздатьДокументВыполненияРаботНадПроектом;
	Элементы.КомментарийВыполненияРаботНадПроектом.Доступность = СоздатьДокументВыполненияРаботНадПроектом;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументВыполненияПроектовПриИзменении(Элемент)
	
	Элементы.КомментарийВыполненияПроектов.Доступность = СоздатьДокументВыполненияПроектов;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяВыполнения_ПланПриИзменении(Элемент)
	
	ВремяВыполненияЧисло = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ВремяВыполнения_План);
	Сумма = ВремяВыполненияЧисло / 60 * УП_РаботаСДокументамиСервер.ПолучитьСтоимостьЧасаРаботыКонтрагента(ДатаОбработки, Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкиПриИзменении(Элемент)
	
	ВыполнитьДо = ДатаОбработки + 3600 * 24 * 3;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПоступлениеОплатыПриИзменении(Элемент)
	
	Элементы.СпособОплаты.Доступность                 = СоздатьДокументПоступлениеОплаты;
	Элементы.КомментарийПоступлениеОплаты.Доступность = СоздатьДокументПоступлениеОплаты;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		СтоимостьЧасаРаботы = УП_РаботаСДокументамиСервер.ПолучитьСтоимостьЧасаРаботыКонтрагента(ДатаОбработки, Объект.Контрагент);
		Элементы.ДекорацияНадписьСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы: " + Строка(СтоимостьЧасаРаботы) + " руб.";
	Иначе
		Элементы.ДекорацияНадписьСтоимостьЧасаРаботы.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеОбработчики

&НаКлиенте
Функция ВыполнитьПроверкуЗаполненияРеквизитов()
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ВыдатьСообщениеПользователюСПривязкойКРеквизиту("Объект.Контрагент", "Контрагент");
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		ВыдатьСообщениеПользователюСПривязкойКРеквизиту("Объект.Клиент", "Клиент");
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		ВыдатьСообщениеПользователюСПривязкойКРеквизиту("Объект.Проект", "Проект");
		Отказ = Истина;
	КонецЕсли;
	
	Если СоздатьДокументСогласования Тогда
		Если НЕ ЗначениеЗаполнено(РуководительПроекта) Тогда
			ВыдатьСообщениеПользователюСПривязкойКРеквизиту("РуководительПроекта", "Руководитель проекта");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ВыполнитьДо) Тогда
			ВыдатьСообщениеПользователюСПривязкойКРеквизиту("ВыполнитьДо", "Выполнить до");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ВремяВыполнения_План) Тогда
			ВыдатьСообщениеПользователюСПривязкойКРеквизиту("ВремяВыполнения_План", "Время выполнения (согласование)");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Сумма) Тогда
			ВыдатьСообщениеПользователюСПривязкойКРеквизиту("СтоимостьПроекта", "Стоимость проекта");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если СоздатьДокументВыполненияРаботНадПроектом Тогда
		Если НЕ ЗначениеЗаполнено(ВремяВыполнения_Факт) Тогда
			ВыдатьСообщениеПользователюСПривязкойКРеквизиту("ВремяВыполнения_Факт", "Время выполнения (выполнение работ)");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КомментарийВыполненияРаботНадПроектом) Тогда
			ВыдатьСообщениеПользователюСПривязкойКРеквизиту("КомментарийВыполненияРаботНадПроектом", "Комментарий (выполнение работ над проектом)");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если СоздатьДокументПоступлениеОплаты Тогда
		Если НЕ ЗначениеЗаполнено(СпособОплаты) Тогда
			ВыдатьСообщениеПользователюСПривязкойКРеквизиту("СпособОплаты", "Способ оплаты");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СоздатьДокументСогласования
		И НЕ СоздатьДокументВыполненияРаботНадПроектом
		И НЕ СоздатьДокументВыполненияПроектов
		И НЕ СоздатьДокументПоступлениеОплаты Тогда
		Сообщение       = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо указать создание одного из документов...";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ВыдатьСообщениеПользователюСПривязкойКРеквизиту(РеквизитФормы, РеквизитСтрока)
	
	Сообщение       = Новый СообщениеПользователю;
	Сообщение.Текст = Строка(РеквизитСтрока) + " не заполнен";
	Сообщение.Поле  = Строка(РеквизитФормы);
	Сообщение.УстановитьДанные(Объект);
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументСогласованияНаСервере()
	
	НовыйДокумент            = Документы.СогласованиеПроектов.СоздатьДокумент();
	НовыйДокумент.Дата       = ДатаОбработки;
	НовыйДокумент.Контрагент = Объект.Контрагент;
	
	// контактное лицо
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактныеЛица.Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.Владелец = &Владелец
	|	И КонтактныеЛица.Основной";
	Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовыйДокумент.КонтактноеЛицо = Выборка.Ссылка;
	КонецЦикла;
	НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.Комментарий = "#Создано обработкой ""Помощник ввода первичных данных проекта""";
	
	// проект
	НовыйПроект                     = НовыйДокумент.Проекты.Добавить();
	НовыйПроект.Клиент              = Объект.Клиент;
	НовыйПроект.Проект              = Объект.Проект;
	НовыйПроект.Валюта              = УП_РаботаСДокументамиСервер.ПолучитьВалютуУчета();
	НовыйПроект.РуководительПроекта = РуководительПроекта;
	НовыйПроект.ВремяВыполнения     = ВремяВыполнения_План;
	НовыйПроект.ВыполнитьДо         = ВыполнитьДо;
	НовыйПроект.Сумма               = Сумма;
	НовыйПроект.Комментарий         = КомментарийСогласования;
	
	// исполнитель
	НовыйИсполнитель             = НовыйДокумент.Исполнители.Добавить();
	НовыйИсполнитель.Клиент      = Объект.Клиент;
	НовыйИсполнитель.Проект      = Объект.Проект;
	НовыйИсполнитель.Исполнитель = ПолучитьТекущегоИсполнителяНаСервере();
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Сообщение       = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан документ """ + Строка(НовыйДокумент) + """";
		Сообщение.Сообщить();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоИсполнителяНаСервере()
	
	Исполнитель = Справочники.Исполнители.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Исполнители.Ссылка
	|ИЗ
	|	Справочник.Исполнители КАК Исполнители
	|ГДЕ
	|	Исполнители.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Ссылка;
	КонецЦикла;
	Возврат Исполнитель;
	
КонецФункции

&НаСервере
Процедура СоздатьДокументВыполненияРаботНадПроектомНаСервере()
	
	НовыйДокумент               = Документы.ВыполнениеРаботНадПроектом.СоздатьДокумент();
	НовыйДокумент.Дата          = ДатаОбработки + 1;
	НовыйДокумент.Контрагент    = Объект.Контрагент;
	НовыйДокумент.Исполнитель   = ПолучитьТекущегоИсполнителяНаСервере();
	НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.Комментарий   = "#Создано обработкой ""Помощник ввода первичных данных проекта""";
	
	// проект
	НовыйПроект                 = НовыйДокумент.Проекты.Добавить();
	НовыйПроект.Клиент          = Объект.Клиент;
	НовыйПроект.Проект          = Объект.Проект;
	НовыйПроект.ВремяВыполнения = ВремяВыполнения_Факт;
	НовыйПроект.Комментарий     = КомментарийВыполненияРаботНадПроектом;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Сообщение       = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан документ """ + Строка(НовыйДокумент) + """";
		Сообщение.Сообщить();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументВыполненияПроектовНаСервере()
	
	НовыйДокумент               = Документы.ВыполнениеПроектов.СоздатьДокумент();
	НовыйДокумент.Дата          = ДатаОбработки + 2;
	НовыйДокумент.Контрагент    = Объект.Контрагент;
	НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.Комментарий   = "#Создано обработкой ""Помощник ввода первичных данных проекта""";
	
	// проект
	НовыйПроект             = НовыйДокумент.Проекты.Добавить();
	НовыйПроект.Клиент      = Объект.Клиент;
	НовыйПроект.Проект      = Объект.Проект;
	НовыйПроект.Валюта      = УП_РаботаСДокументамиСервер.ПолучитьВалютуУчета();
	НовыйПроект.Сумма       = Сумма;
	НовыйПроект.Комментарий = КомментарийВыполненияПроектов;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Сообщение       = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан документ """ + Строка(НовыйДокумент) + """";
		Сообщение.Сообщить();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументПоступлениеОплатыНаСервере()
	
	НовыйДокумент                = Документы.ПоступлениеОплатыОтКонтрагента.СоздатьДокумент();
	НовыйДокумент.Дата           = ДатаОбработки + 3;
	НовыйДокумент.Контрагент     = Объект.Контрагент;
	НовыйДокумент.СпособОплаты   = СпособОплаты;
	НовыйДокумент.СуммаДокумента = Сумма;
	НовыйДокумент.Ответственный  = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.Комментарий    = "#Создано обработкой ""Помощник ввода первичных данных проекта""";
	
	// проект
	НовыйПроект             = НовыйДокумент.Проекты.Добавить();
	НовыйПроект.Клиент      = Объект.Клиент;
	НовыйПроект.Проект      = Объект.Проект;
	НовыйПроект.Валюта      = УП_РаботаСДокументамиСервер.ПолучитьВалютуУчета();
	НовыйПроект.Сумма       = Сумма;
	НовыйПроект.Комментарий = КомментарийПоступлениеОплаты;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Сообщение       = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан документ """ + Строка(НовыйДокумент) + """";
		Сообщение.Сообщить();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
